
&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	П = Новый Структура("Номенклатура", Объект.Ссылка);
	ОткрытьФорму("Справочник.fish_ОписаниеНоменклатурыДляСайта.ФормаВыбора",П,Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	П = Новый Структура("Номенклатура, Ключ", Объект.Ссылка, Объект.fish_ОписаниеДляСайта);
	ОткрытьФорму("Справочник.fish_ОписаниеНоменклатурыДляСайта.ФормаОбъекта", П);
КонецПроцедуры
