
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатура = Параметры.Номенклатура;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;                                 
	П = Новый Структура("Номенклатура, Ключ", Номенклатура, Элемент.ТекущаяСтрока);
	ОткрытьФорму("Справочник.fish_ОписаниеНоменклатурыДляСайта.ФормаОбъекта", П);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;                                 
	П = Новый Структура("Номенклатура, Ключ", Номенклатура, Элемент.ТекущаяСтрока);
	ОткрытьФорму("Справочник.fish_ОписаниеНоменклатурыДляСайта.ФормаОбъекта", П);
	
КонецПроцедуры

